{
  "clubs": [
    {
    "name": "Academy of Creative Media Student Association",
    "type": "Academic/Professional",
    "description": "The purpose of our organization is to foster pride, unity and professionalism among students enrolled in the Academy of Creative Media program in UH Manoa.",
    "owner": "Hwang Hao Marcus Goh",
    "ownerMail": "hwang@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Accounting Club",
    "type": "Academic/Professional",
    "description": "In cooperation with the School of Accountancy, we provide additional perspectives and supplemental information concerning public, private, and governmental accounting. Our main goal is to promote the professional and personal development of our members through socials, community service, professional interactions, workshops, and office tours. We continue to rank high among the largest student organizations within the Shidler College of Business and welcome students from all academic disciplines.",
    "owner": "Rana Mejes",
    "ownerMail": "rana@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Advocates for Public Interest Law",
    "type": "Academic/Professional",
    "description": "The purpose of the organization is to support and promote the commitment of the students, alumni of the William S. Richardson School of Law, and the legal community to serve the public interest and to encourage the practice of public interest law. The purpose of the organization shall be accomplished by educating students and the legal community about opportunities in public interest law and providing monetary grants to students and alumni to further justice by serving underrepresented persons addressing issues that affect the public interest.",
    "owner": "Lane Mullin",
    "ownerMail": "lane@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "AIKIDO at UHM",
    "type": "Sports/Leisure",
    "description": "We practice Aikido.",
    "owner": "Timothy Halliday",
    "ownerMail": "timothy@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "AlohaThon Dance Marathon",
    "type": "Service",
    "description": "AlohaThon is a nonprofit and part of the Children's Miracle Network Organization. Children's Miracle Network supports different Dance Marathons around U.S college campuses in order to raise money for their local Children's Miracle Network Hospitals. Our local CMN hospital which serves the state of Hawai'i and the Pacific region, is Kapi'olani Medical Center for Women and Children. All 100% of our funds raised are donated directed to Kapi'olani and last year we raised over $20,000. In the previous years, money raised went towards building their new NICU. This year we are looking to expand our event in order to raise the most money that we can for Kapi'olani.",
    "owner": "Kate Rodriguez",
    "ownerMail": "kate@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Alpha Gamma Delta Delta Sigma",
    "type": "Fraternity/Sorority",
    "description": "Alpha Gamma Delta is an international women's fraternity that promotes academic excellence, philanthropic giving, ongoing leadership and personal development and above all, a spirit of loving sisterhood.",
    "owner": "Ashley Terrell",
    "ownerMail": "ashley@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Alpha Omega Hawaii",
    "type": "Religious/Spiritual",
    "description": "The primary function of Alpha Omega Hawaii will be to provide students with the opportunity for spiritual growth by interacting with other students who are Christians at UH and to encourage academic excellence.",
    "owner": "Maile Morrell",
    "ownerMail": "maile@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Alpha Sigma Phi",
    "type": "Fraternity/Sorority",
    "description": "Alpha Sigma Phi strives to become the fraternity of choice among undergraduate men coming to the University of Hawaii at Manoa. This year Alpha Sigma Phi will be focused on appealing to undergraduate men of all backgrounds and beliefs to better our campus through better men. Our main goal for this academic year is to change the outlook of Greek life on our campus, by working with different non-profit and philanthropic organizations on campus and within the community.",
    "owner": "Tyler Miller",
    "ownerMail": "tyler@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "American Association of University Women at UH Manoa",
    "type": "Political",
    "description": "The mission of our RIO is to promote the values of AAUW on the UHM campus and in the community; we are working towards equality in society by providing the tools necessary for women to gain economic security, to pursue their education, and advocate for women's rights.",
    "owner": "Susannah Kandikatti",
    "ownerMail": "susannah@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "American Indian Science and Engineering Society at University of Hawai'i",
    "type": "Academic/Professional",
    "description": "The American Indian Science and Engineering Society (AISES) is a national nonprofit organization focused on substantially increasing the representation of Indigenous peoples of North America and the Pacific Islands in science, technology, engineering, and math (STEM) studies and careers.",
    "owner": "Kahiamaikalani Walker",
    "ownerMail": "kahiamaikalani@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "American Institute of Architecture Students Hawaii Chapter",
    "type": "Academic/Professional",
    "description": "The American Institute of Architecture Students (AIAS) is an independent, nonprofit, student-run organization dedicated to providing unmatched progressive programs, information, and resources on issues critical to architecture and the experience of education. The AIAS aims to promote excellence in architectural education, training, and practice; to foster an appreciation of architecture and related disciplines; to enrich communities in a spirit of collaboration; and to organize students and combine their efforts to advance the art and science of architecture.",
    "owner": "Beau Nakamori",
    "ownerMail": "beau@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "American Library Association Student Chapter",
    "type": "Academic/Professional",
    "description": "The American Library Association Student Chapter at the University of Hawai'i at Manoa Library and Information Science Program is committed to celebrating and promoting the library and information science profession. Our members plan events and activities that encourage professional development, service to the library community, fundraising, socializing, and networking. We are always looking for new members and new perspectives, and we invite all interested to bring your skills, energy and enthusiasm to our chapter!",
    "owner": "Kylee Munro",
    "ownerMail": "kylee@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "American Marketing Association",
    "type": "Academic/Professional",
    "description": "We are a marketing club that strives to push our members to grow socially, philanthropically, and professionally.",
    "owner": "Aaron Goo",
    "ownerMail": "aaron@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "American Society of Civil Engineers",
    "type": "Academic/Professional",
    "description": "The objective of the chapter shall be to develop professional consciousness, to afford an opportunity for the members to become acquainted, to promote a spirit of congeniality, and to provide contact with the civil engineering profession.",
    "owner": "Kassidy Mashiyama",
    "ownerMail": "kassidy@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "American Society of Heating, Refrigeration, and Air-Conditioning Engineering Student Branch at UH Manoa",
    "type": "Academic/Professional",
    "description": "The purposes of the ASHRAE UH Manoa Student Branch include, but are not limited to: (I) the advancement of the sciences of heating, refrigerating and air-conditioning engineering and related sciences; (II) the continuing education of the members and other interested persons in said sciences, through lectures, demonstrations and publications; (III) the rendition of career guidance to students of the sciences; and (IV) the encouragement of the scientific research.",
    "owner": "Precious Pangelinan",
    "ownerMail": "precious@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "American Society of Mechanical Engineers",
    "type": "Academic/Professional",
    "description": "The ASME at the University of Hawaii is an organization dedicated to providing services tot eh UHM College of Engineering (CoE) mechanical engineering students which includes (1) professional development and networking, (2) being a conduit between the CoE and the mechanical engineering student body, and (3) facilitating interactions between mechanical engineering students, all to benefit students' growth in the mechanical engineering field.",
    "owner": "Linda Qu",
    "ownerMail": "linda@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Anakbayan Hawai'i",
    "type": "Political",
    "description": "As an integral part of the national democratic movement of the Philippines the mission and purpose of Anakbayan-USA is to gather the broadest possible political, moral, material and sectoral support for Anakbayan Philippines and the national democratic struggle of the Filipino people.",
    "owner": "Germaine Linday Juan",
    "ownerMail": "germaine@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Animal Science Club",
    "type": "Academic/Professional",
    "description": "The Animal Science Club at the University of Hawaii at Manoa is committed to students who share an interest and passion for animals and livestock production systems. The club accomplishes its mission by organizing events that emphasize education and hands-on experience. The club also participates in community service events.",
    "owner": "Renee Yano",
    "ownerMail": "renee@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Anime Manga Society of Hawai'i @ UH Manoa",
    "type": "Leisure/Recreational",
    "description": "A place for students to watch and talk about anime.",
    "owner": "Tyler Asato",
    "ownerMail": "tyler@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Anthropology Graduate Student Association",
    "type": "Academic/Professional",
    "description": "AGSA, a volunteer organization comprised of graduate students in the Department of Anthropology, has 2 primary goals:1. To support graduate student research, projects, and outreach activities. 2. To assist in the facilitation of faculty-graduate student communication and student retention, and act as an interface between department administration and the graduate student body. 3. To support the overall graduate student experience through social and group activities.AGSA also interfaces with the Graduate Student Organization (GSO), which represents the interests of graduate students across campus. Additionally, AGSA organizes a number of events including occasional professional development workshop series, an annual graduate student research symposium, and occasional community service projects.",
    "owner": "Steven Powell",
    "ownerMail": "steven@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Anthropology Undergraduate Student Association",
    "type": "Academic/Professional",
    "description": "(1) The creation of an accessible means for all students interested in anthropology to gain familiarity with the diverse areas of study within the discipline, and to utilize the resources that are available to them through the University of Hawai'i at Manoa, the College of Social Sciences, & the Department of Anthropology.(2) A forum for students to network through discussion of current events, topics, and debates relevant to anthropology and related disciplines. (3) Provide interested students with guidance, support and practical experience to adequately prepare them for a career and/or graduate/post-baccalaureate studies in anthropology.(4) Offer opportunities for students to practice their kuleana (responsibility) within the community and learn invaluable skills through a variety of volunteer and learning opportunities.",
    "owner": "Katherine Babcock",
    "ownerMail": "katherineb@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "ASD Student Group",
    "type": "Service",
    "description": "This clubs purpose is to provide a community for students on the autism spectrum. It is meant to be a place for students on the spectrum to meet other autistic students and do fun activities together. We will have weekly meetings getting to know each other, to discuss autism and issues autistic students face, and do cool activities like arts and crafts, a slideshow day (to talk about our interests with each other) and more!",
    "owner": "Anneke Wirth-Yap",
    "ownerMail": "anneke@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Asian Field Study Association",
    "type": "Academic/Professional",
    "description": "The purpose of the Asian Field Study Alumni Association (AFSAA) is to establish, nurture, and maintain international relationships with an emphasis on international business. We aim to share knowledge with the goals of stimulating economic growth, learning, remaining up to date on trends, and networking with the executives of the future.",
    "owner": "Deran Yamada",
    "ownerMail": "deran@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Asian-Pacific Law & Policy Journal",
    "type": "Academic/Professional",
    "description": "The Asian-Pacific Law and Policy Journal (APLPJ) is a web-based, American legal journal covering issues in Asia and the Pacific Rim. Our objectives are to disseminate legal research by law professors, legal practitioners, social scientists, economists, and students; to increase awareness of legal issues impacting the region and to provide a forum to discuss legal topics that fall within the Journal's geographic scope. APLPJ publishes articles, translations, book reviews, essays, case notes, and comments on current topics in comparative and transnational law focused on one or more countries or geographic entities in the Asia-Pacific region.",
    "owner": "Keoni Williams",
    "ownerMail": "keoni@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Associated Students of the John A. Burns School of Medicine (JABSOM)",
    "type": "Student Affairs",
    "description": "The purpose of Associated Students of JABSOM (ASJABSOM) and the JABSOM Classes is to serve as the official body representing the medical students of JABSOM. To that end, purposes include, but are not limited to:(1) advocating on behalf of the medical students of JABSOM;(2) promoting the welfare of JABSOM and its students;(3) fostering student morale;(4) providing a forum for the expression of student interests and concerns to the faculty,administration, and staff;(5) promoting collaboration between the JABSOM Classes;(6) supporting academic and social interaction among the students, faculty, administration, and the greater community;(7) encouraging service in JABSOM and the community;(8) providing services and activities beneficial to ASJABSOM members, JABSOM, and the community;(9) selecting student delegates to JABSOM committees and other bodies with campus-wide representation; and(10) directing and regulating the activities of ASJABSOM and the JABSOM Classes.Notwithstanding any provision of this Constitution, the purposes of ASJABSOM and the JABSOM Classes are limited exclusively to non-profit purposes.",
    "owner": "Eduardo Biala, Jr.",
    "ownerMail": "eduardo@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Association for Computing Machinery at the University of Hawaii at Manoa",
    "type": "Service",
    "description": "ACM is a global scientific and educational organization dedicated to advancing the art, science, engineering, and application of computing, serving both professional and public interests by fostering the open exchange of information and by promoting the highest professional and ethical standards. The main goals of the organization is to promote professional and technical development, facilitate networking, and enrich the lives of the organization members.",
    "owner": "Kana'i Gooding",
    "ownerMail": "kanai@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Association for Women in Math - University of Hawai'i at Manoa chapter",
    "type": "Academic/Professional",
    "description": "Since its founding in 1971 by a small but passionate group of women mathematicians, the Association for Women in Mathematics (AWM) has grown into a leading society for women in the mathematical sciences, and is one of the societies comprising the Conference Board of the Mathematical Sciences. AWM's programs not only support those who participate in them directly, but also help influence the mathematics culture more generally, so that young women entering the field today encounter an environment that is more nurturing than that of the 1970's and 1980's. Throughout its 50 year History, the AWM has played a critical role in increasing the presence and visibility of women in the mathematical sciences.",
    "owner": "Swarnalakshmi Lakshmanan",
    "ownerMail": "swarnalakshmi@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Atherton YMCA",
    "type": "Service",
    "description": "The YMCA is a nonprofit fellowship dedicated to practicing and implementing programs that build a healthy spirit, mind, and body. Atherton especially focuses on programs and volunteer opportunities that allow individuals to give back to their community and develop skills needed for the workforce. We are one of the few YMCA branches in the nation that are dedicated to serve college-aged individuals.",
    "owner": "Joshua Lorica",
    "ownerMail": "joshua@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Ballroom Dance Club at UH",
    "type": "Leisure/Recreational",
    "description": "Promote both social and competitive ballroom dance",
    "owner": "Ravi Narayan",
    "ownerMail": "ravi@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Baptist Collegiate Ministries O'ahu",
    "type": "Religious/Spiritual",
    "description": "We are a College ministry setting out to bring students together in deep friendship and community, to grow in their faith, and leadership throughout their college career.",
    "owner": "Devin Valencia-Pereles",
    "ownerMail": "devin@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Be The Match",
    "type": "Service",
    "description": "Be The Match, operated by the National Marrow Donor Program (NMDP), is a nonprofit organization dedicated to helping every patient get the life-saving transplant they need. As trusted leaders in advancing treatments for those facing life-threatening blood cancers, we provide ground-breaking research, innovative technologies, patient support, and education that save lives. Through this club on campus, we will be able to spread awareness of our cause and hopefully find someone's match.",
    "owner": "Sydney Shibuya",
    "ownerMail": "sydneys@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Bedroom Artists and Musicians at the University of Hawaii at Manoa",
    "type": "Leisure/Recreational",
    "description": "The Bedroom Artist and Musicians at The University of Hawaii at Manoa (BAMTUHM) was founded to create a network of individuals who either partake in the creation of music in all its genres and formats or those who wish to learn to do so. The purpose of BAMTUHM is to create a strong community of thriving artists, facilitate a safe space for creativity and growth for our members and provide guidance and support to our members who wish to learn how to create music as well as continue to provide help to our veteran artists. More importantly we would like to make sure members enjoy being part of this community and that they have fun.",
    "owner": "Nikolaus Kang",
    "ownerMail": "nikolaus@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Best Buddies Chapter at UHM",
    "type": "Service",
    "description": "Best Buddies International is a nonprofit 501(c)(3) organization dedicated to establishing a global volunteer movement that creates opportunities for one-to-one friendships, integrated employment, leadership development, and inclusive living for individuals with intellectual and developmental disabilities (IDD). As a Best Buddies chapter, we are committed to providing activities and outings to create inclusive friendships between UHM college students and persons with disabilities.",
    "owner": "Robin Dazzeo",
    "ownerMail": "robin@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Beta Alpha Psi - Delta Theta Chapter",
    "type": "Honorary Society",
    "description": "Beta Alpha Psi is the international honor organization for financial information students and professionals. The purpose of this organization shall be to instill in its members a desire for self-improvement, foster high moral and ethical standards in its members, encourage and give recognition to scholastic and professional excellence, cultivate a sense of responsibility and services in its members, promote the collegiate study of accounting, and provide opportunities for association among its members.",
    "owner": "Emily Quach",
    "ownerMail": "emily@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Beta Beta Gamma",
    "type": "Fraternity/Sorority",
    "description": "To bring together a group of strong, caring women to create a sisterhood of leadership, community, and diversity. To give back to our community and raise a group of strong intelligent women",
    "owner": "Jordan Humphrey",
    "ownerMail": "jordan@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Black Student Association",
    "type": "Leisure/Recreational",
    "description": "To create a safe space for Black folk to come together and talk story.",
    "owner": "Breena Thompson",
    "ownerMail": "breena@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Botanical Society of America Hawai'i Chapter at University of Hawai'i at Manoa",
    "type": "Academic/Professional",
    "description": "The Botanical Society of America (\"BSA\") Hawai'i Chapter (\"Chapter\") shall be operated for scientific and educational purposes. Its mission is to promote botany, the field of basic science dealing with the study and inquiry into the form, function, development, diversity, reproduction, evolution, and uses of plants and their interactions within the biosphere. To accomplish this mission, the objectives of the Chapter are to: sustain and provide improved formal and informal education about plants; encourage basic plant research; provide expertise, direction, and position statements concerning plants and ecosystems; and foster communication within the professional botanical community, and between the rest of the local community through meetings, activities, and community outreach.",
    "owner": "Pierson Nitz Caldwell",
    "ownerMail": "pierson@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Business Executive Society of Tomorrow",
    "type": "Academic/Professional",
    "description": "The Business Executive Society of Tomorrow is a general business club at the University of Hawaii at Manoa's Shidler College of Business. Founded by students in 1998, BEST has a proud history of maintaining and perpetuating excellence in its members. Through the years, we have developed a culture of diligence and dedication to personal and professional growth. Through a combination of tours, workshops, networking events, alumni events, community services, and socials, we strive to mold our members into well-rounded individuals. We pride ourselves in producing the business leaders of tomorrow, and we provide our members with ample opportunities to continually advance toward that goal.",
    "owner": "Rachel Lu",
    "ownerMail": "rachel@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "C.O.P. Alaka'ina",
    "type": "Academic/Professional",
    "description": "Our purpose is to promote college success and post-secondary opportunities for our College Opportunities Program (COP) students. COP Alaka'ina serves our COP freshmen and alumni throughout the academic year by providing guidance, information, and workshops about academic and college life at UH Manoa. Our areas of focus are the following: professional development, community service, socials, and fundraising. As COP primarily serves those who are economically disadvantaged, academically underprepared, and those who come from underrepresented communities, every bit of support counts",
    "owner": "Ilikea Silva",
    "ownerMail": "ilikea@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Chemistry Club at the University of Hawaii at Manoa",
    "type": "Academic/Professional",
    "description": "The purpose of this club is to assist students currently enrolled in chemistry classes by providing tutors and hosting group study sessions. The club will also provide members with opportunities to volunteer in STEM outreach in the community.",
    "owner": "Michaela Kop",
    "ownerMail": "mkop@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Chi Alpha Hawaii",
    "type": "Religious/Spiritual",
    "description": "WE DISCIPLE UNIVERSITY STUDENTS TO FULFILL THEIR PURPOSE IN GOD'S GLOBAL PLAN. Our mission is to reconcile students to Christ, equipping them through Spirit-Filled communities of prayer, worship, fellowship, discipleship, and mission to transform the university, the marketplace and the world.",
    "owner": "Kimberlyn Joy Agacir",
    "ownerMail": "kimberlyn@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Chi Epsilon",
    "type": "Honorary Society",
    "description": "Chi Epsilon is the National Civil Engineering Honor Society. We are dedicated to maintaining and promoting the status of civil engineering as an ideal profession here on the UHM campus. To contribute to the improvement of the profession, Chi Epsilon fosters the development and exercise of sound traits of character and technical ability among civil engineers, and its members, by precept and example, toward an ever higher standard of professional service. We provide tutoring in lower-level CEE courses, commit ourselves frequently to community service events, offer career development opportunities for our members, and host social events.",
    "owner": "Dea Bongolan",
    "ownerMail": "dea@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Circle K International",
    "type": "Academic/Professional",
    "description": "To build character, to build leaders, and to serve the community.",
    "owner": "Gianna Young",
    "ownerMail": "gianna@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Class of 2023 at JABSOM",
    "type": "Student Affairs",
    "description": "The purpose of this organization is to (1) bring students together outside of class in order to share and exchange experiences, (2) serve as coordinators of recurring student-led events held at the John A. Burns School of Medicine (referred to as JABSOM from this point on), and (3) fundraise/oversee/dispense funds for the purpose of class activities, academic opportunities, and graduation celebrations.",
    "owner": "Eliott Koshi",
    "ownerMail": "eliott@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Class of 2024 at JABSOM",
    "type": "Student Affairs",
    "description": "Serve as liaisons between the larger student body and JABSOM faculty (e.g. Office of Medical Education and Office of Student Affairs). Consult, deliberate, and make decisions for student-led events held at the John A. Burns School of Medicine (referred to as JABSOM from here on). Fundraise and dispense funds for the purpose of class activities, academic opportunities, and other celebrations (ie. graduation)",
    "owner": "Collin Liang",
    "ownerMail": "collin@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Class of 2025 at JABSOM",
    "type": "Student Affairs",
    "description": "\"The purpose of this organization is to gather a group of students to:1. Serve as liaisons between the larger student body and JABSOM faculty (e.g. Office of Medical Education and Office of Student Affairs).2. Consult, deliberate, and make decisions for student-led events held at the John A. Burns School of Medicine (referred to as JABSOM from here on).3. Fundraise and dispense funds for the purpose of class activities, academic opportunities, and other celebrations (i.e., graduation and senior luau).\"",
    "owner": "Eduardo Biala, Jr.",
    "ownerMail": "eduardo@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Class of 2026 at JABSOM",
    "type": "Student Affairs",
    "description": "The purpose of this organization is to gather a group of students to: 1. Serve as liaisons between the larger student body and JABSOM faculty (e.g. Office of Medical Education and Office of Student Affairs).2. Consult, deliberate, and make decisions for student-led events held at the John A. Burns School of Medicine (referred to as JABSOM from here on).3. Fundraise and dispense funds for the purpose of class activities, academic opportunities, and other celebrations (i.e., graduation and senior luau).The organization was founded with the intention to allow students the opportunity to, when elected by the student body, represent and serve the class. The group will abide by all established University of Hawaii (and JABSOM) rules, regulations, and policies, as well as all local, state, and federal laws.",
    "owner": "D-Dre Wright",
    "ownerMail": "d-dre@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Climbing Club at UHM",
    "type": "Sports/Leisure",
    "description": "Educating students on how to climb safely and well.",
    "owner": "Henry Korver",
    "ownerMail": "henry@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Coalition to Stop Campus Hunger",
    "type": "Service",
    "description": "The purpose of the Coalition to Stop Campus Hunger at UH Manoa is threefold. 2.1 To develop a sustainable community and institutional infrastructure necessary to improve food security for the UH Manoa campus community. 2.2 To encourage all members of the UH Manoa community to become involved in solving food insecurity issues on campus. 2.3 To help remove the social stigma that goes along with being food insecure.",
    "owner": "Lara Hackney",
    "ownerMail": "lara@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Collegiate Association for the Research of Principle Hawai'i",
    "type": "Academic/Professional",
    "description": "In CARP, Collegiate Association for the Research of Principles, student leaders engage in thoughtful and meaningful discussion as well as deep and long-lasting relationships for peace and growth. CARP works to create the ideal by studying and practicing principles taught by great role models and teachers in every field throughout history.",
    "owner": "Rena Saito",
    "ownerMail": "rena@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "CTAHR Student Ambassadors",
    "type": "Academic/Professional",
    "description": "To recruit prospective members to the College of Tropical Agriculture and Human Resources (CTAHR), to encourage student interest and participation in CTAHR, and to positively portray CTAHR to the university and outside communities.",
    "owner": "Michelle Au",
    "ownerMail": "michelle@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Delta Sigma Pi: Rho Chi",
    "type": "Fraternity/Sorority",
    "description": "Delta Sigma Pi is a professional fraternity organized to foster the study of business in universities; to encourage scholarship, social activity and the association of students for their mutual advancement by research and practice; to promote closer affiliation between the commercial world and students of commerce, and to further a higher standard of commercial ethics and culture and the civic and commercial welfare of the community.",
    "owner": "Anthony Lee",
    "ownerMail": "anthony@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Dermatology Interest Group at the John A. Burns School of Medicine at the University of Hawaii at Manoa",
    "type": "Academic/Professional",
    "description": "To connect medical students interested in dermatology with mentors,workshops, and extracurricular activities that will expand their dermatological knowledge and (hopefully) help them match into this highly competitive specialty.",
    "owner": "Alyssa Roberts",
    "ownerMail": "alyssa@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Disney Ohana Club",
    "type": "Academic/Professional",
    "description": "The Disney Ohana Club is a social club that hopes to be a positive, fun place where Disney fans can meet, talk, and enjoy all things Disney!",
    "owner": "Tiffany Ng",
    "ownerMail": "tiffanyn@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Drone Technologies at the University of Hawaii",
    "type": "Academic/Professional",
    "description": "DTUH is an interdisciplinary Vertically Integrated Project [VIP] consisting of various engineering majors such as Mechanical, Electrical, and Computer Engineering. VIP allows for the involvement of students from all undergraduate class standings (Freshman through Senior class standing). The purpose of DTUH is to expand the real-world applications of unmanned aerial systems [UAS], commonly referred to as drones. Every year, DTUH participates in the annual Association for Unmanned Vehicle Systems International Student Unmanned Aerial Systems [AUVSI SUAS] competition. The AUVSI SUAS competition provides a suitable environment for the advancement of Search and Rescue technologies of drones. The aim of DTUH is to provide undergraduate University of Hawaii Engineering students with unparalleled, extra-curricular educational opportunities in the cutting-edge field of drones.",
    "owner": "Camryn Jamila",
    "ownerMail": "camryn@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "E1R1",
    "type": "Leisure/Recreational",
    "description": "\"The Collective is enacted to serve the underserved community in Honolulu, HI and at University of Hawai'i at Manoa through Hip Hop dance. The Collective aims to provide \"pathways into higher education\" workshops, free dance classes, and performances by the Collective both at the UH Manoa (outside and within the dance department) and within the community at large, such as elementary schools, middle schools, high schools, community colleges, and various promotional and community events. The Collective acknowledges the sanctity of Black life and aims to rectify academic racism with the promotion of anti-oppression, anti-racism, and liberation as guiding principles within all activities and events. To recognize the sanctity of Black life and POC as creators and participants of Hip Hop culture, the Collective will utilize intersectional and interdisciplinary approaches to social justice and community service through Hip Hop dance. The Collective will seek to establish a relationship between UH Manoa and the Honolulu community which denounces structural inequality, colonialism, settler colonialism, racism, hetereopatriarchy (in all its forms including anti-Black misogyny), orientalism, white supremacist ideology, and homophobia. The Collective aims to enact coalitional collaboration across differences as the Collective is of mixed backgrounds, with acknowledgement of the land on which we practice as stolen from Native Hawaiian, Kanaka Maoli, and Pacific Islander peoples.The mission of E1R1 Collective is to serve the underserved community in Honolulu, Hi through hip-hop dance. We do this by providing free workshops, dance classes, and performances to the community. \"",
    "owner": "Stephanie Sirju",
    "ownerMail": "stephanie@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "East-West Toastmasters",
    "type": "Academic/Professional",
    "description": "To provide a mutually supportive and positive learning environment in which every member has the opportunity to develop communication and leadership skills, which in turn foster self-confidence and personal growth",
    "owner": "Fernando Santiago-Mandujano",
    "ownerMail": "fernando@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Engineers' Council at the University of Hawai'i",
    "type": "Academic/Professional",
    "description": "The Engineers' Council at the University of Hawai'i (ECUH) is a student-operated executive board, consisting of elected executive board (officer) positions, Affiliate College of Engineering (COE) Student Organization representatives, and a council member body. The mission of the ECUH is to provide unity action through cooperative, transparent, and effective representation of the student body of the COE at the University of Hawai'i at Manoa. By collaborating with students, faculty, affiliate student organizations, affiliate project organizations, and professional partners, the ECUH serves to promote academic, intellectual, cultural, and social understanding throughout the COE, and to provide students with the finest education environment possible.",
    "owner": "Eric Jonah Lorica",
    "ownerMail": "eric@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "English Majors Association",
    "type": "Academic/Professional",
    "description": "The purpose of this organization shall be to promote interaction amongst the students and faculty within the English Department, create an active literary community, and increase participation in both on-campus and off-campus English related events and activities. The English Majors Association will extend its membership opportunity once per semester to the entirety of the English major and minor in the hopes of increasing interconnectivity amongst students. With passion and dedication put forth towards the English discipline, the EMA will actively seek substantial opportunities for student involvement and recognition amongst peers and faculty. Increased participation and influence in the English department will be available to members of the EMA, as well as, an open-minded environment which values individual intellect, opinion, and creativity.",
    "owner": "Krysten Nakamura",
    "ownerMail": "krysten@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Environmental Justice Club at University of Hawai'i",
    "type": "Service",
    "description": "To enhance environmental justice",
    "owner": "Hayden Kasal-Barsky",
    "ownerMail": "hayden@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Eta Sigma Delta Honor Society",
    "type": "Honorary Society",
    "description": "Our mission is to lead hospitality and tourism students to the highest levels of professionalism and achievement.",
    "owner": "Emily Quach",
    "ownerMail": "emily@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Ethnic Studies Student Association",
    "type": "Ethnic/Cultural",
    "description": "\"The Ethnic Studies Student Association at the University of Hawai'i at Manoa (ESSA) is a non-profit organization. Our central goals are:To encourage learning and create an open dialogue about culture, identity, socio-political issues and inequality in all our courses, across all fields of study, and throughout the University system and Hawai'i.To take a critical stance against classism, colonization, fascism, homophobia, racism, sexism, transphobia, and the systematic marginalization of any people, especially indigenous Hawaiians.To work for diversity, equity, equality and justice in our classes, campus and community.To organize and co-sponsor events, social activism, and communal art inline with our central goals.To invite, host, and support artists, scholars, organizers, and other organizations inline with our central goals.To create safe spaces, a support network, and moments of celebration for those seeking refuge from oppression.\"",
    "owner": "Dani Smith",
    "ownerMail": "dani@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Every Nation Campus",
    "type": "Religious/Spiritual",
    "description": "Every Nation is a global family of churches dedicated to establishing church-planting churches, reaching the next generation on the campus, and preaching the gospel to every nation.",
    "owner": "Jomari Garcia",
    "ownerMail": "jomari@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Family Medicine Interest Group",
    "type": "Academic/Professional",
    "description": "The purpose of FMIG is to increase interest in Family Medicine and address Hawaii's primary care deficit, provide professional development through networking opportunities with Family Medicine Physicians, and increase community outreach to Hawaii's underserved and vulnerable populations.",
    "owner": "Kylie Popovich",
    "ownerMail": "kylie@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Financial Management Association",
    "type": "Academic/Professional",
    "description": "It is the Mission of the Financial Management Association (FMA) to further the Professional and Personal Development of Hawaii's next Generation of Finance Professionals and Leaders.",
    "owner": "Christopher Scott-Gray",
    "ownerMail": "christopher@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Food Science and Human Nutrition Council",
    "type": "Academic/Professional",
    "description": "The purpose of the Food Science and Human Nutrition Council is: To enhance student fellowship and scholarship, to facilitate student-faculty communication, and to promote the dissemination of food science and human nutrition information. To expose members to career information, scholarships, and volunteer opportunities. To network with members of the professional community in the fields of food science and human nutrition. To foster the personal and professional development of the individual such as leadership, organization, communication and other related skills.",
    "owner": "Micheal Yanos",
    "ownerMail": "michael@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Generation Action",
    "type": "Political",
    "description": "Generation Action at the University of Hawaii at Manoa is an affiliate of Planned Parenthood Action Fund. It is a movement of diverse college professionals seeking to engage peers and community members in fighting for reproductive health and freedom, racial equity, inclusivity, and other such important issues. Generation Action encourages others to mobilize into political action to defend and fight for progressive policy at city, state, and national levels. Generation Action serves as a coalition partner to allies at the state, national, and international reproductive rights efforts. Generation Action believes in the fundamental right of every individual to manage his or her reproductive health and to have full access to comprehensive reproductive and complementary health care services in settings that preserve and protect the essential privacy and rights of each individual. Generation Action advocates for public policies that guarantee these rights and insure access to such services. Generation Action also supports access to medically accurate educational programs that enhance one's understanding of human sexuality. Generation Action also acknowledges and supports the dynamic perspective and intersectional framework that young people are using to connect reproductive health to other issues such as civil rights, immigration, the environment,gender identity policies and other related social justice issues.",
    "owner": "Kaila Baker",
    "ownerMail": "kaila@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Global Health Interest Group",
    "type": "Academic/Professional",
    "description": "To spread awareness and educate others on health problems and issues affecting populations on a global scale; to understand and aid in on going issues including infectious diseases, poor sanitation, and inadequate nutrition of individuals of all countries; to improve the health and to create a better world for all with ongoing awareness and education on global health issues",
    "owner": "Awapuhi Lee",
    "ownerMail": "awapuhi@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Graduate Business Student Association (GBSA)",
    "type": "Academic/Professional",
    "description": "To provide activities and support for the graduate business students at Shidler",
    "owner": "Ancil Sewell",
    "ownerMail": "ancil@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Graduate Hui Ola Pono",
    "type": "Academic/Professional",
    "description": "The Hui provides a space for public health students to present the ideas, interests, and concerns of the members of the student body and serves as a liaison between the students, faculty, and administration. The Hui facilitates communication and involvement among students through scheduled meetings, coordination of social and educational activities, and dissemination of necessary information. The Hui is an organization that provides students with opportunities to promote Public Health within both the university and Hawai'i community at large through outreach, education, and fundraising. Another facet of the group is to provide support and guidance for incoming students and link students in the Public Health program with other students and Public Health professionals locally, nationally, and internationally.",
    "owner": "Cade Akamu",
    "ownerMail": "cade@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Graduate Women in Science Hawaii",
    "type": "Academic/Professional",
    "description": "The mission of Graduate Women in Science Hawai'i (GWISH) is to support the present and future women scientists of Hawai'i, the Pacific Region, and the globe, by providing a collaborative network of practicing scientists, professional development opportunities, and opportunities for community outreach. Our group unites professionals across multiple disciplines and from diverse backgrounds to celebrate the scientific endeavors of women and girls in their own personal and professional lives.",
    "owner": "Daneila Escontrela",
    "ownerMail": "daneila@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Grey Hats at UH Manoa",
    "type": "Academic/Professional",
    "description": "The purpose of the organization is to provide education on cybersecurity topics, facilitate mentorship from relevant professionals and create an environment where interested individuals can learn cybersecurity fundamentals.",
    "owner": "Jake Imanaka",
    "ownerMail": "jake@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Hawai'i Streams and Ecosystems",
    "type": "Academic/Professional",
    "description": "The purpose of the Hawaii Streams and Ecosystems Organization is to educate, understand, and continuously explore streams throughout Hawaii. We hope to gain and spread more knowledge about the biological and cultural importance of Hawaii's streams and the benefits they provide, and promote awareness as to why stream conservation is vital in Hawaii.",
    "owner": "Damien X Wallace",
    "ownerMail": "damien@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Hawaii Student Entrepreneurs",
    "type": "Academic/Professional",
    "description": "Hawai'i Student Entrepreneurs was formed with the mission to inspire students to be entrepreneurs and to support them in starting and growing their own businesses. HSE works to connect students to build professional relationships.",
    "owner": "Daniella Pasion",
    "ownerMail": "daniella@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Hawaii Alpha Chapter of Pi Gamma Mu",
    "type": "Academic/Professional",
    "description": "To encourage and recognize superior scholarship in social science disciplines and to foster cooperation and social service among its members. Pi Gamma Mu serves the various social science disciplines which seek to understand and explain human behavior and social relationships as well as their related problems and issues.",
    "owner": "Melvin Dizon",
    "ownerMail": "melvin@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Hawaii Sigma Pi",
    "type": "Academic/Professional",
    "description": "Pi Tau Sigma Preamble: \"In order to establish a closer bond of fellowship which will result in mutual benefit to those men and women in the study and in the profession of mechanical engineering, who by their academic or practical achievements, manifest a real interest and marked ability in their chosen work, this constitution of the International Pi Tau Sigma Mechanical Engineering Honor Society was established.",
    "owner": "Cassidy Hihara",
    "ownerMail": "cassidy@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Hawaii Undergraduate Initiative",
    "type": "Academic/Professional",
    "description": "Hawaii Undergraduate Initiative (HUI) is a summer leadership program providing a free 3-credit summer college course for a select group of incoming freshmen at the University of Hawaii at Manoa. In addition to the summer course, HUI offers engaging and insightful workshops on using university resources, exploring academics/careers and developing writing/math skills. All HUI participating scholars will be paired with a Peer Mentor who will support and assist them in their transition from high school to college. After the summer, we transition into an RIO to offer continued support for our students through different events such as volunteer work, socials, and professional development workshops.",
    "owner": "Khahn Nguyen",
    "ownerMail": "khahn@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Hawaiian Society of Law and Politics",
    "type": "Academic/Professional",
    "description": "Promote interdisciplinary Hawaiian Law and Politics at the University of Hawaii; and Assist students with their selections of courses; and Host speaking events and conferences; and Host social gatherings.",
    "owner": "Sweetie Kuehu",
    "ownerMail": "sweetie@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "High Intensity Athletics at UHM",
    "type": "Sports/Leisure",
    "description": "To continually promote both cheerleading and personal excellence for each athlete and a lifelong love of these activities in a caring, respectful, safe, and supportive environment. We believe that cheerleading is more than just a sport: with High Intensity Athletics it is a way of life.",
    "owner": "Lynette Rudolfo",
    "ownerMail": "lynette@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Hillel Hawaii",
    "type": "Religious/Spiritual",
    "description": "To foster an environment where students can engage in Jewish events and be connected to the local Jewish community.",
    "owner": "Mason Russo",
    "ownerMail": "mason@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Hui Kako'o: Social Work Graduate Student Organization",
    "type": "Academic/Professional",
    "description": "Hui Kako'o SW GSO is a student-led organization that represents and advocates for students interests and needs to the school administration and plans events and programs that promote community, professional development, and critical awareness of local and global issues.Our purpose is to create a body responsive to the needs and desires of its constituents. While developing a responsible as well as critical awareness of prevalent attitudes and actions through participation in co-curricular activities. Open to all Master's in Social Work and PhD in Social Welfare students. Students include campus-based and distance-education. We work to hold social events to bring individuals together and build community, host professional development events for members to connect with alumni and deepen their knowledge of social issue. While often collaborating with the Public Health hui and Bachelor of Social Work Student Organization",
    "owner": "Bernadette Rose Garrett",
    "ownerMail": "bernadette@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Hui Ola Pono",
    "type": "Academic/Professional",
    "description": "Promote the Office of Public Health Studies' mission within the university by encouraging undergraduate students to actively engage in health promotion in our local community.",
    "owner": "Sarah Haanen",
    "ownerMail": "sarah@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "ICSpark",
    "type": "Academic/Professional",
    "description": "To provide opportunities to 6th to 12th grade students to learn web development and work with college students as mentors. This opportunity will run throughout the Spring, and we will work on training mentors in the Fall.",
    "owner": "Preston Garcia",
    "ownerMail": "preston@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Indigenous Student Association",
    "type": "Ethnic/Cultural",
    "description": "The purpose of this organization is to help establish a community among Native American, Alaskan Natives, and other Indigenous students at the University of Hawai'i at Manoa. This organization was created with the intention to provide Indigenous students with resources, scholarships, and other opportunities in higher education that are meant for Native American, Alaskan Native, and Indigenous students specifically. On a larger scale, the goal is to create a supportive community of Indigenous students and maintain an open environment for cultural expression. The Indigenous student Association will work to diminish the negative stereotypes surrounding our communities and establish a safe space for conversations surrounding cultural practices or issues. The Indigenous Student Association at the University of Hawai'i at Manoa will also abide by any rules and regulations established by the University's policies.",
    "owner": "Ruby Aliason",
    "ownerMail": "ruby@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Institute of Electrical and Electronics Engineer Student Branch",
    "type": "Academic/Professional",
    "description": "The Institute of Electrical and Electronics Engineering wants to promote student's academic success. We aim to encourage students to engage with the electrical and computer engineering community at the University of Hawaii at Manoa.",
    "owner": "Gwyneth Raquepo",
    "ownerMail": "gwyneth@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Inter-Business Council",
    "type": "Academic/Professional",
    "description": "\"We, the represented registered independent business organizations at the Shidler College of Business (SCB), Inter-Business Council (IBC) as it stands: in order to better serve and be responsive to the needs of the recognized undergraduate population; to serve as liaison between the SCB undergraduate student body, the SCB student organizations, the SCB administration, the faculty of the SCB, the Alumni Association, and the Hawai'i community.\"",
    "owner": "Sean Scott",
    "ownerMail": "sean@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "International Business Organization",
    "type": "Academic/Professional",
    "description": "IBO's main focus is to promote Shidler College of Business's mission of International Excellence. Through professional development events, global analysis workshops, socials, and more we help our members explore the possibilities out there.",
    "owner": "Sydni Kim",
    "ownerMail": "sydni@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "International Student Association",
    "type": "Ethnic/Cultural",
    "description": "The International Student Associations purpose is to promote global friendship and understanding, support new and continuing students in their educational objectives, explore issues and places in Hawaii, develop leadership among international students, and to have fun.",
    "owner": "Jessica Bandol",
    "ownerMail": "jessicab@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Intervarsity Christian Fellowship",
    "type": "Religious/Spiritual",
    "description": "Transformed by God's Aloha, together we bless the campus, the islands, and the nations",
    "owner": "Hannah Archer",
    "ownerMail": "hannah@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "ITMA (Information Technology Management Association)",
    "type": "Academic/Professional",
    "description": "Our mission is to strengthen the social and professional network between members in the Information Technology Management Association, alumni, and professionals by focusing on the development of quality relationships. ITMA is motivated and dedicated to provide its members with social and professional opportunities, provide access to technical resources, and lead the way for the growing technical environment in order to foster career development.",
    "owner": "Jacob Graham",
    "ownerMail": "jacob@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Japanese Culture Club",
    "type": "Academic/Professional",
    "description": "We aim to deepen understanding of Japanese culture, promote friendship among members of different cultures, and to develop a relationship and understanding between Japan and Hawai'i.",
    "owner": "Lauren Bradley",
    "ownerMail": "lauren@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Jehovah's Witnesses",
    "type": "Religious/Spiritual",
    "description": "Bible based discussions with free Bible based literature will be available to the public. Two two-wheeled carts will offer the literature. Each cart is approx. 3 feet wide by 5ft high. One cart will have literature printed in the English language and the other cart will have literature in multiple foreign languages. The carts will be approx. 10 feet apart. An attendant will be standing on each side of the carts to answer questions. No food or drinks, including alcohol will be served.",
    "owner": "Roberta Baird",
    "ownerMail": "roberta@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Judo Club/Team at the University of Hawaii",
    "type": "Sports/Leisure",
    "description": "-To provide opportunity to practice judo, a lifelong physical and mental education system. -To develop excellent moral character and promote the spirit of social entrepreneurship to serve community. -To offer leadership development opportunities to members through club and team organizational management and hosting community events. -To serve as a local community hub for young adult judo practitioners from Hawaii, USA, Japan, and other international countries to foster lifelong friendship. -To inspire and promote K-12 students to pursue higher education through our presence in the local judo community.",
    "owner": "Kohtaroh Uchida",
    "ownerMail": "kohtaroh@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "K-Pop Cardio Crew",
    "type": "Leisure/Recreational",
    "description": "Here at KPCC we strive for three main things: 1) To promote fitness within the community 2) To express appreciation for pop music in all languages 3) To break language barriers through exercise and music",
    "owner": "Amber Ikalani",
    "ownerMail": "amber@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Ka Lama Kukui Indigenous Health Interest Group",
    "type": "Service",
    "description": "Ka Lama Kukui, \"The Light of the Kukui Tree,\" was given this name since the kukui tree is the kinolau of Kane, the god of health and fresh water, and lama means light, knowledge, and wisdom. Our goal is to perpetuate the light that has been given to us.",
    "owner": "Awapuhi Lee",
    "ownerMail": "awapuhi@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Ka Lau O Ka Lahui",
    "type": "Service",
    "description": "The group was established to create a welcoming, all-inclusive environment in which haumana can come together and support one another in reconnecting to our ancestry and land. This work is primarily done through hands-on community service activities. ",
    "owner": "Kaci Stokes",
    "ownerMail": "kaci@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Ka Mea Kolo Entomology Club",
    "type": "Academic/Professional",
    "description": "The purpose of Ka Mea Kolo is to share our understanding and enthusiasm for the Earth's most diverse creatures espcially those that have made Hawai'i their home. The Lorax spoke for the trees (Dr. Seuss 1971). We speak for the insects. We provide presentations to school groups and community organizations around O'ahu. We hope to raise awareness of just how important insects are in the world.",
    "owner": "Michelle Au",
    "ownerMail": "michelle@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Katipunan Club",
    "type": "Academic/Professional",
    "description": "KATIPUNAN is the name given to the Kapatiran ng Mga Estudanteng Nag-aaral ng Pilipino sa Unibersidad ng Hawai'i (Confraternity of students taking Filipino courses at the University of Hawai'i System.) The name was inspired by the secret society founded by Philippine hero Andres Bonifacio during the Filipino-Spanish War in 1896. This society specifically used Tagalog (the basis of the Filipino language) in their communications and rituals in order to promote their unity and shared cultural identity.",
    "owner": "Justin Gerald Ocampo",
    "ownerMail": "justin@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Kim's Taekwon Do at UHM",
    "type": "Sports/Leisure",
    "description": "To promote Martial arts, self defense, discipline, self-control, integrity and physical fitness to the UH community.",
    "owner": "Mason Nakadomari",
    "ownerMail": "mason@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Korea Peace Now Campus Network at University of Hawaii Chapter",
    "type": "Political",
    "description": "We are the University of Hawai'i chapter of the organization Korea Peace Now. Korea Peace Now is a transnational, feminist organization working to end the Korean War and to build a lasting peace on the Korean Peninsula. Open to all members of the UH ohana, we plan to spread awareness on campus about peace on the Korean peninsula and around the world. We also plan to grow our membership and to find potential leaders interested in the peace movement. As for our activities, in coordination with our national and Hawai'i chapters as well as other peace-related groups at UH, we will organize events such as Korea Peace Advocacy Week, screening of movies on war and peace, and lectures by people who are experts in the peace movement.",
    "owner": "Yejun Kweon",
    "ownerMail": "yejun@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Lambda Pi Eta Omega Upsilon Chapter",
    "type": "Academic/Professional",
    "description": "The purpose of Lambda Pi Eta is: (a) to recognize, foster and reward outstanding achievement in communication studies; (b) to stimulate interest in the field of communication; (c) to promote and encourage professional development among communication majors; and (d) to provide an opportunity to discuss and exchange ideas in the field of communication.",
    "owner": "Karlee Shay",
    "ownerMail": "karlee@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Language Documentation Training Center",
    "type": "Academic/Professional",
    "description": "The Language Documentation Training Center of the Department of Linguistics at the University of Hawai'i at Manoa aims to train community members of underdocumented languages in the skills of language documentation, while spreading awareness about linguistic diversity and language endangerment.",
    "owner": "Josiah Murphy",
    "ownerMail": "josiah@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Linguistics Society of Manoa",
    "type": "Academic/Professional",
    "description": "The mission of LSM is to promote academic and social activity among the students, staff, and faculty at the University of Hawai'i at Manoa who are interested in linguistics. We are dedicated to the promotion of linguistics, and to making the study of language fun, social, inclusive, and interactive.",
    "owner": "Carolyn Siegman",
    "ownerMail": "carolyn@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Manoa Academy of Gamers",
    "type": "Leisure/Recreational",
    "description": "Manoa Academy of Gaming (MAG) is a place for everyone that loves games, wants to learn some useful business and work skills using the medium of E-Sports and Gaming, and/or wants a safe place on campus to have fun and meet the different types of gamers across the UH Manoa campus!",
    "owner": "Albert Yee",
    "ownerMail": "albert@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Manoa Creative Productions",
    "type": "Academic/Professional",
    "description": "The purpose of this organization shall be to provide students with the tools, means, leadership, and communication skills necessary to fulfill potential interests and wants of the Academy of Creative Media Animation students.",
    "owner": "Cheska Nicole Nunag",
    "ownerMail": "cheska@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Manoa Scholars Club",
    "type": "Academic/Professional",
    "description": "The purpose of the Manoa Scholars Club is to give students the opportunity to represent the best and brightest at UH Manoa both academically and in character. Students who have a stronger commitment to their university are more likely to retain and enhance their success. Many of the scholars were active members in their high schools and community and would like to carry that same sense of pride and commitment as a University of Hawai'i at Manoa student.",
    "owner": "Elizabeth Aquino Peterson",
    "ownerMail": "elizabeth@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Manoa Student Ambassadors",
    "type": "Student Affairs",
    "description": "The Manoa Student Ambassadors are dedicated to the positive promotion of UH Manoa. We serve as liaisons between the current UH Manoa student community and prospective students, parents, alumni, and friends of the University. They will seek to enhance prospective students' knowledge about the various student support services and programs offered at UH Manoa and share their own student experiences as a Rainbow Warrior. To represent UH Manoa at University events including Explore Manoa, Manoa Experience - University Preview Day, Accepted Student Receptions, Student Panels & Webinars, Campus Tours, and other events designated by the UH Manoa Office of Admissions and other members of the campus community as approved by the Ambassador Executive Board.",
    "owner": "Kaitlin Nalani Tilitile",
    "ownerMail": "kaitlin@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Marine Robotics at the University of Hawaii",
    "type": "Academic/Professional",
    "description": "MRUH is a student-run organization dedicated to fostering student interest at the University of Hawaii in marine robotics. MRUH is also a Vertically Integrated Project (VIP) team which focuses on creating an opportunity for a wide diversity of students to work on projects together. This allows undergraduate and graduate students of all skill levels and majors to collaborate on a project that they are passionate about.",
    "owner": "Cheng Jie Wu",
    "ownerMail": "cheng@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Med-Peds Interest Group",
    "type": "Academic/Professional",
    "description": "The objective of MPIG shall be to increase awareness of and interest in the medical specialty of Internal Medicine-Pediatrics, to contribute to the education of JABSOM students and to provide interactions between medical students and med-peds physicians.",
    "owner": "Ashley Lee",
    "ownerMail": "ashley@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Medical Student Mentorship Program",
    "type": "Academic/Professional",
    "description": "The purpose of this organization is to pair current medical students at the John A. Burns School of Medicine (JABSOM) with undergraduate students in Hawaii interested in pursuing a career in medicine.",
    "owner": "Kylie Popovich",
    "ownerMail": "kylie@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "MILUN",
    "type": "Ethnic/Cultural",
    "description": "To appreciate and learn about the various culture around the world",
    "owner": "Tanvir Islam",
    "ownerMail": "tanvir@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Midshipmen Association at the University of Hawaii at Manoa",
    "type": "Service",
    "description": "The purpose of the organization shall be to provide a community for Midshipman of Naval Reserve Officer Training Corps at the University of Hawai'i at Manoa (UH NROTC), as well as a community of supporters to the Midshipman. The group shall be focused on providing a service foundation to the community as well as a way to fundraise to promote growth and opportunities for those in the organization.",
    "owner": "Zachary Barto",
    "ownerMail": "zachary@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Moku o Lo'e Student Association",
    "type": "Academic/Professional",
    "description": "The mission of Moku o Lo'e Student Association is to generate a strong student community that enhances professional development, interdisciplinary collaborations, and academic growth.",
    "owner": "Katherine Grellman",
    "ownerMail": "katherineg@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Molecular and Cell Biology Club at the University of Hawai'i at Manoa",
    "type": "Academic/Professional",
    "description": "The Molecular Cell Biology Club at the University of Hawai'i at Manoa serves to foster student interest in the field of cell biology, promote extra-curricular educational opportunities, and support student interactions with peers and professionals who have similar interests.",
    "owner": "Jane Kwan",
    "ownerMail": "jane@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Mortar Board National Honor Society Hui Po'okela Chapter at the University of Hawai'i at Manoa",
    "type": "Honorary Society",
    "description": "Mortar Board Senior National Honor Society has long been recognized in the O'ahu community for its continued partnership with diverse service projects with other student clubs and non-profit organizations all over the island. This is a national collegiate honor society for students in their senior year. Each chapter is typically composed of only a handful of carefully selected applicants for the year - the Hui Po'okela Chapter usually does not exceed 25 members at a time. Potential members are chosen based on how they measure in accord with Mortar Board's key values: scholarship, leadership, and service. Those who excel in said values are then carefully examined through a series of interviews hosted by the chapter's current members. It is a great opportunity to give back to the community and form close friendships with fellow Mortar Board members. This honor society is more than just prestige, but rather, an opportunity for every undergraduate senior to make a local impact in their campus and community before they graduate. Once initiated in Mortar Board, every member will engage in various community service and fundraising activities. We not only help support each other and the O'ahu community through various events but above all, we are making a global impact by building and growing the best leaders of tomorrow.",
    "owner": "Chloe Angeline Rhaeshaun Velasco",
    "ownerMail": "chloe@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Muslim Student Association",
    "type": "Academic/Professional",
    "description": "The mission of the Muslim Student Association at UHM is to help its students maintain their faith and cultivate their Muslim identity in various ways. It seeks to foster good community values while creating an inclusive space to support its students. It also aims to promote personal growth and life skill development to provide students with the tools to succeed in college and beyond.",
    "owner": "M Arifur Rahman",
    "ownerMail": "arifur@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Na Hawai'i 'Imi Loa Hui Haumana",
    "type": "Academic/Professional",
    "description": "To service the Hawaiian community, by strengthening the Native Hawaiian presence in the Library and Information Sciences profession, and by building the capacity of the Hawaiian community in Library and Information Sciences practices.",
    "owner": "Ikaika Keliiliki",
    "ownerMail": "ikaika@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Na Koa Lani booster Club",
    "type": "Academic/Professional",
    "description": "The purpose of the Na Koa Lani Booster Club is to bolster the development of future Air Force leaders by supporting and improving the experience of Air Force Reserve Officer Training Corps (AFROTC) cadets at the University of Hawaii at Manoa (UHM) through fundraising and sponsoring extracurricular activities.zThe purpose of the Na Koa Lani Booster Club is to bolster the development of future Air Force leaders by supporting and improving the experience of Air Force Reserve Officer Training Corps (AFROTC) cadets at the University of Hawaii at Manoa (UHM) through fundraising and sponsoring extracurricular activities.",
    "owner": "Deonmark Alimaleata",
    "ownerMail": "deonmark@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "National Society of Collegiate Scholars, Manoa Chapter",
    "type": "Academic/Professional",
    "description": "The National Society of Collegiate Scholars (NSCS) is an honors organization that recognizes and elevates high-achieving students. NSCS provides career and graduate school connections, leadership and service opportunities, and gives out more than $500,000 annually in scholarships, awards, and chapter funds.",
    "owner": "Melvin Joseph Dizon",
    "ownerMail": "melvin@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Natural Resources and Environmental Management Graduate Student Organization",
    "type": "Service",
    "description": "Serves graduate students within our department by providing opportunities to make social and professional connections, representing graduate student interests, and facilitating access to funding, the GSO hosts a monthly pau hana (happy hours) for graduate students, faculty, and staff",
    "owner": "Alohi Nakachi",
    "ownerMail": "aloha@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Natural Sciences Student Ambassadors",
    "type": "Academic/Professional",
    "description": "Our organization strives to promote a welcoming and inclusive community for all students pursuing an undergraduate degree in the Natural Sciences. Members of our organization will act as mentors and leaders, aiding incoming students in their transition to our University and building camaraderie amongst continuing students",
    "owner": "Chase Kane",
    "ownerMail": "chase@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Newman Club",
    "type": "Religious/Spiritual",
    "description": "Newman Club is a Catholic Campus Ministry serving the University of Hawaii at Manoa students, faculty and staff. We are a diverse and inclusive community, a home away from home for students where \" heart speaks to heart\". We provide life-long spiritual development, leadership skill training, retreats, community building, socials and more to help people of all ages to grow in understanding how we are called to live our faith.",
    "owner": "Montserrat Montanes i Arbo",
    "ownerMail": "montanes@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "OB/GYN Interest Group",
    "type": "Academic/Professional",
    "description": "The JABSOM OB/GYN Interest Group's mission is to foster student interest in OB/GYN, serve as a resource for hands-on activities and research opportunities pertaining to OB/GYN, and provide guidance to students who are interested in pursuing OB/GYN residencies.",
    "owner": "Julia Jahansooz",
    "ownerMail": "juliaj@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Ohana Intersectionality Alliance",
    "type": "Student Affairs",
    "description": "'Ohana Intersectionality Alliance is committed to connecting students of different communities and identities to resources on campus, as well as providing a place for people who don't feel like they fit in.",
    "owner": "Anaiss Arreola",
    "ownerMail": "anaiss@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "One Health At JABSOM",
    "type": "Academic/Professional",
    "description": "The purpose of the organization shall be to:A. Provide a platform for medical students interested in One Health to interact with peers who share similar interests and goals.B. Provide opportunities for medical students to expand their knowledge of One Health by means of discussions, workshops, and presentations. C. Define the One Health concept and its importance to human, animal, and environmental health.D. Apply the One Health approach to medical educationAs a Registered Independent Organization (RIO), One Health will abide by all UHM policies and operate in a manner to uphold all JABSOM standards and values.",
    "owner": "Carley Kida",
    "ownerMail": "carley@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Osu! Club at UH Manoa",
    "type": "Leisure/Recreational",
    "description": "To promote a community involving the video game \"osu!\" among other similar interests. The overall goal is to create a club that allows people to meet others who are osu! players and socialize in a comfortable space.",
    "owner": "Sola Takahashi",
    "ownerMail": "sola@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Pacific Advocates Peoples Association",
    "type": "Ethnic/Cultural",
    "description": "PAPA creates a sense of belonging for students at the University of Hawai'i at Manoa, developing student leaders of Native Hawaiian and Pacific Islander ancestry and supporting all students who are passionate about aboriginal/indigenous island cultures, history, preservation, perpetuation, research, & documentation. PAPA bridges the University and student body with our host culture and the oceanic community by addressing the needs of the community through advocacy and civic engagement.",
    "owner": "Zea F.P. Nauta",
    "ownerMail": "zea@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Panhellenic Association",
    "type": "Academic/Professional",
    "description": "The objective of the Panhellenic Association shall be to develop and maintain women's sorority life and inter-sorority relations at a high level of accomplishment and in so doing to: 1. Consider the goals and ideals of member groups as continually applicable to campus and personal life. 2. Promote superior scholarship and basic intellectual development. 3. Cooperate with member women's sororities and the university/college administration in concern for and maintenance of high social and moral standards. 4. Act in accordance with National Panhellenic Conference (NPC) Unanimous Agreements, policies and best practices. 5. Act in accordance with such rules established by the Panhellenic Council as to not violate the sovereignty, rights and privileges of member women's sororities",
    "owner": "Sidney Bumgarner",
    "ownerMail": "sidney@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Partnership for Social Justice",
    "type": "Service",
    "description": "Our organization is founded in the principles of social responsibility and the pursuit of health as a human right. As a result, we seek to advocate for equality and basic human rights for all.",
    "owner": "Kylie Popovich",
    "ownerMail": "kylie@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Party Wave Surf Club",
    "type": "Sports/Leisure",
    "description": "The purpose of the Party Wave surf club is to give UHM students the opportunity to find friends to surf with and to overall have fun with. Our goal is to get people interested in surfing no matter what skill level. Beginners all the way to advanced surfers are welcome to join. The party wave surf club is dedicated to creating opportunities for anyone to surf, with multiple events every week there will always be an opportunity to participate no matter what openings are in their schedule.",
    "owner": "Mikayla Chinn",
    "ownerMail": "mikayla@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Patient Safety and Quality Improvement Interest Group",
    "type": "Academic/Professional",
    "description": "The purpose of the organization shall be to: A. Provide a platform for medical student interested in patient safety and quality improvement to interact with peers who share similar interests and goals. B. Provide opportunities for medical students to expand their knowledge on patient safety by means of workshops, presentations, and online modules. C. Aid medical students in their search for patient safety and quality improvement/outcomes related research.",
    "owner": "Alyssa Kameoka",
    "ownerMail": "alyssa@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Peace Sustainability and Advocacy",
    "type": "Service",
    "description": "We aim to promote peacebuilding in our local communities, particularly to allow marginalized, underrepresented, or misrepresented groups to be heard and understood with empathy. The club has five main goals: 1) Broad acceptance of all including but not limited to individuals within the student body of the University of Hawai'i at Manoa (UHM) and local communities, emphasizing the understanding of peace within the individual, group, and society, 2) Fostering informal conversations on conflicts we face and emphasize coping strategies and supports, inclusion, and empathy, 3) Increasing informal and formal oral communication skills and group problem solving, 4) Teaching current and future students of UHM about the efforts of the Matsunaga Institute for Peace (Matsunaga Institute), and 5) Connecting with the community and empower UHM voices so we can help create and empower diverse and distinct identities.",
    "owner": "Jessica Lau",
    "ownerMail": "jessical@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Pediatric Interest Group",
    "type": "Academic/Professional",
    "description": "The purpose of this organization is to allow medical students opportunities to supplement their academic experience with events that expose them to pediatric medicine. This organization provides clinical and networking events throughout the year to provide support for those interested in this field.",
    "owner": "Riley Parks",
    "ownerMail": "riley@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Phi Alpha Nu Sigma",
    "type": "Honorary Society",
    "description": "The purpose of Phi Alpha is to provide a closer bond among students of social work and promote humanitarian goals and ideals. Phi Alpha fosters high standards of education for social workers and invites into membership with those who have attained excellence in scholarship and achievement in social work.",
    "owner": "Stewart Silva",
    "ownerMail": "stewart@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Phi Alpha Theta - Alpha Beta Epsilon",
    "type": "Academic/Professional",
    "description": "Phi Alpha Theta is the national honor society for history students which brings students and faculty together to share their interests in history. The Alpha Beta Epsilon chapter has been very active in sponsoring events and sharing history with students and the local community. Phi Alpha Theta fosters a commitment to historical excellence and academic achievement.",
    "owner": "Joshua Lourence",
    "ownerMail": "joshua@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Phi Mu Iota Alpha",
    "type": "Fraternity/Sorority",
    "description": "Founded in 1852, Phi Mu is a women's organization which provides personal and academic development, service to others, commitment to excellence and lifelong friendship through a shared tradition. Phi Mu promotes vibrant living, encouraging members to achieve their personal best.",
    "owner": "Taylor Posadas",
    "ownerMail": "taylor@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Philippine Medical Student Association of Hawaii",
    "type": "Academic/Professional",
    "description": "PMSAH is a community service organization at the John A. Burns School of Medicine (JABSOM) at the University of Hawaii at Manoa. The goal of PMSAH is to teach and celebrate Filipinx culture, offer mentorship to Filipinx students at JABSOM, UH Manoa, and beyond, and bring awareness to social justice and cultural sensitivity of Filipinx patients. Secondly, PMSAH will encourage Filipinx youths to seek careers in the health field.",
    "owner": "Shantel Pascual",
    "ownerMail": "shantel@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Powerlifting Club at the University of Hawai'i at Manoa",
    "type": "Sports/Leisure",
    "description": "To form a team that can represent the University of Hawai'i at local, state, and national competitions. The mission is to support the University of Hawai'i at Manoa community by providing an engaging, encouraging, and safe environment for members.",
    "owner": "Daniel Aguirre",
    "ownerMail": "daniel@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Pre-Medical Association at the University of Hawaii at Manoa",
    "type": "Academic/Professional",
    "description": "THE PRE-MEDICAL ASSOCIATION (PMA) IS THE LARGEST PRE-HEALTH ORGANIZATION AT THE UNIVERSITY OF HAWAI'I AT Manoa. PMA STRIVES TO PROVIDE STUDENTS WITH A HOLISTIC PERSPECTIVE OF THE FIELD OF HEALTHCARE, HELP MEMBERS TO DEVELOP ACADEMICALLY AND PROFESSIONALLY THROUGH SERVICE AND LEADERSHIP OPPORTUNITIES, AND FOSTER COLLEGIALITY AMONG PEERS WITH SIMILAR GOALS AND INTERESTS.",
    "owner": "Chase Kane",
    "ownerMail": "chase@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Pre-Optometry Club",
    "type": "Academic/Professional",
    "description": "Our purpose is to provide an opportunity for students to learn more about optometry and to connect with others interested in the field.",
    "owner": "Sara Kim",
    "ownerMail": "sara@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Pre-Pharmacy Association",
    "type": "Academic/Professional",
    "description": "The Pre-Pharmacy Association is meant to assist students interested in Pharmaceutical careers. We provide networking, community service opportunities, and vital resources to students who share the goal of becoming certified pharmacists!",
    "owner": "Kiersty McKee",
    "ownerMail": "kiersty@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Pre-Physician Associate Club",
    "type": "Academic/Professional",
    "description": "The creation of the Pre-Physician Associate Club is to helpfully inform Pre-Physician Assistant students about the history and purpose of the profession, as well as provide any information concerning admission requirements to Physician Assistant schools. Additionally, this club will be an excellent opportunity to have experiences in the medical field through community services and medical events to meet and shadow Physician Assistants.",
    "owner": "Rachel Yun",
    "ownerMail": "rachel@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Psi Sigma: The Psychology Connection",
    "type": "Academic/Professional",
    "description": "To serve as the connection among psychology students; facilitate social interaction and psychology discussion. We encourage the pursuit of psychological science, foster enduring connections among peers in psychology, and advance the academic and professional development of our members. Psi Sigma uphold's the values of knowledge, benevolence, and integrity.",
    "owner": "Jennifer Manning",
    "ownerMail": "jennifer@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "PsiChi: The International Honor Society in Psychology",
    "type": "Honorary Society",
    "description": "Psi Chi is an international honor society whose purpose shall be to encourage, stimulate, and maintain excellence in scholarship of the individual members in all fields, particularly in psychology, and to advance the science of psychology.",
    "owner": "Jessica Sasabe",
    "ownerMail": "jessicas@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Public Administration Student Organization",
    "type": "Academic/Professional",
    "description": "The mission of the Public Administration Student Organization (PASO) at the University of Hawaii at the University of Hawaii at Manoa is to foster educational collaboration and networking among members, to provide a platform for the exchange of ideas, and to build professional relationships with the public service community in Hawaii.",
    "owner": "Sharon Baillie",
    "ownerMail": "sharon@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Public Relations Student Society of America",
    "type": "Academic/Professional",
    "description": "The declared purpose of PRSSA is to cultivate a favorable and mutually advantageous relationship between students and professional public relations practitioners. The student Society aims to foster the following: 1. Understanding of current theories and procedures of the profession; 2. Encouraging the highest ideals and principles; 3. Instilling a professional attitude; 4. Encouraging Section, Associate and eventually Accredited PRSA membership",
    "owner": "Ashley Taylor",
    "ownerMail": "ashley@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Rainbow Pride Alliance",
    "type": "Academic/Professional",
    "description": "The purpose of the Rainbow Pride Alliance (RPA) is to support sexual and gender minority (SGM) diversity efforts within JABSOM and the community by promoting education, safe spaces, awareness, and ongoing discussion of SGM health.",
    "owner": "Madeleine Chai",
    "ownerMail": "madeleine@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Real Estate Club at University of Hawaii",
    "type": "Academic/Professional",
    "description": "Provides opportunities for networking, career development, and education for students interested in Real Estate.",
    "owner": "Huaiyu Zheng",
    "ownerMail": "huaiyu@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Reformed University Fellowship",
    "type": "Religious/Spiritual",
    "description": "\"The purpose of Reformed University Fellowship is to reach and equip students with the gospel of Jesus Christ. We are a group on campus seeking to grow in our relationship with God while also sharing what we know to others. RUF is a community where students can make friends, grow in their faith, serve the community and have fun doing it.\"",
    "owner": "Nicholas Lee",
    "ownerMail": "nicholas@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Rotaract Club at the University of Hawai'i Manoa",
    "type": "Service",
    "description": "The purposes of this club are for:Rotary members to recognize the positive change implemented by young adults through an active and personal commitment to empower young adults and young professionals to take action through community and international service, develop leadership skills through professional development, and gain a global perspective that fosters world peace and cultural understanding as partners in service; and for students and young professionals to take action through community and international service that creates sustainable solutions to local and global challenges, connect with the global community of Rotary to expand professional networks, exchange ideas with leaders, and cultivate lifelong friendship around the world, develop skills to become community and global leaders, make friends locally and globally, and have fun while recognizing the importance of Service Above Self.",
    "owner": "Joyce Rosabia",
    "ownerMail": "joyce@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Runners at Manoa",
    "type": "Leisure/Recreational",
    "description": "Runners at Manoa aims to connect students through recreational jogging and running. Whether one is experienced or a complete beginner, the club hopes to be a positive outlet for after-school workouts in a comfortable and relaxing environment. Inclusion is a vital aspect of the club; therefore, all skill levels are welcome, including those that have never run before.",
    "owner": "Marcus Rodriguez",
    "ownerMail": "marcus@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Rural Health Interest Group",
    "type": "Academic/Professional",
    "description": "To promote medical practice on the outer islands and underserved areas of Oahu, increase awareness about physician shortage in Hawaii and nationwide, provide medical students with education about rural health issues, and to advocate for better health care in rural communities.",
    "owner": "Tiffany Kurozawa",
    "ownerMail": "tiffanyk@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Salsa Dancing @ UHM",
    "type": "Sports/Leisure",
    "description": "The Salsa Dancing at UHM (SD@UHM) group's purpose is to provide all UHM students and community members with a safe and welcoming environment for learning and practicing salsa, merengue and bachata dancing. The group offers members free dance lessons and a stress free environment for learning and sharing cultural perspectives and promoting the benefits of cultural diversity.",
    "owner": "Gordon Walker",
    "ownerMail": "gordon@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Second Language Studies Student Association",
    "type": "Academic/Professional",
    "description": "The Second Language Studies Student Association (SLSSA) is an association of graduate students in the Department of Second Language Studies (SLS) at the University of Hawai'i at Manoa. We are dedicated to enrishing the academic, professional and social lives of our members. We seek to provide avenues for development in these areas through various events throughout the year. We also seek to connect our members to career and volunteer opportunities outside the department and the university.",
    "owner": "Ha Nguyen",
    "ownerMail": "ha@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Sigma Theta Tau at UHM",
    "type": "Honorary Society",
    "description": "The purpose of this organization is to promote nursing scholarship among students and faculty at UHM and the larger nursing community, especially those affiliated with the Sigma Theta Tau International Honor Society of Nursing professional organization. Specific activities and functions of the organization will include mentoring, professional networking, and other activities that promote nursing scholarship and excellence.",
    "owner": "Gary Glauberman",
    "ownerMail": "gary@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Society of American Archivists Student Chapter",
    "type": "Academic/Professional",
    "description": "SAAsc seeks to promote archival interests in our academic community; discuss archival issues and the archival profession; engage in professional activities and foster career development; invite professional archivists and others with relevant expertise to discuss theoretical perspectives, practical experiences, or research initiatives; visit repositories and organize participation in events of related interest; know of the objectives, policies, programs, and publications of the SAA; represent our SAASC at SAA and state archivists' meetings, and promote communication with other student groups within University of Hawai'i at Manoa's Library and Information Science Program, as well as student chapters at other universities, in order to develop mutual interests within the library and archival professions.",
    "owner": "Wen lin",
    "ownerMail": "wen@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Society of Automotive Engineers",
    "type": "Academic/Professional",
    "description": "The mission of the SAE is to provide technical resources and facilitate the integration of underclassmen in environments that develop leadership, time management, and technical skills through our sponsored projects.",
    "owner": "Abigail Macalintal",
    "ownerMail": "abigail@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Society of Human Resources Management - Aloha Chapter",
    "type": "Academic/Professional",
    "description": "Promotes collaboration and interaction among diverse individuals with an expressed interest in the study of Human Resources Management and its theories, practices, and applications.",
    "owner": "Susan Iverson",
    "ownerMail": "susan@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Society of Women Engineers",
    "type": "Academic/Professional",
    "description": "Empower women to achieve full potential in careers as engineers and leaders, expand the image of the engineering and technology professions as a positive force in improving the quality of life, and demonstrate the value of diversity and inclusion.",
    "owner": "Nyah Chamberlain",
    "ownerMail": "nyah@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Special Libraries Association Student Chapter",
    "type": "Academic/Professional",
    "description": "The SLAsc seeks to provide students with a relaxed environment to explore special libraries with others who are interested in pursuing a career working as a special librarian.",
    "owner": "Jazmin Decosmo",
    "ownerMail": "jazmin@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Special Olympics Hawai'i at University Hawai'i Manoa",
    "type": "Sports/Leisure",
    "description": "The purpose of Special Olympics Hawaii (SOHI) at UHM is to connect college students and individuals with intellectual disabilities through sport to build friendships and help lead the social justice movement of Special Olympics. This is an opportunity for the students of University of Hawaii, Manoa to enhance the living of people with intellectual disabilities and build a more accepting campus for everyone.",
    "owner": "Austin Buchanan",
    "ownerMail": "austin@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Spikeball Club",
    "type": "Sports/Leisure",
    "description": "Our club is inclusive for all students, regardless of your major. The purpose of this club is to meet other students, be more involved in school events, and to come together and have fun. It's a great opportunity for students to get active, create meaningful friendships, and learn to collaborate with others.",
    "owner": "Kai He",
    "ownerMail": "kaih@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Sports Medicine Interest Group",
    "type": "Academic/Professional",
    "description": "SMIG provides unique opportunities for medical students to learn about Sports Medicine and to be involved with the community.",
    "owner": "Franchessca Johnson",
    "ownerMail": "franchessca@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Stole Society",
    "type": "Academic/Professional",
    "description": "Stole Society is dedicated to the manufacturing of stoles for the graduating students and classes for the College of Tropical Agriculture and Human Resources (CTAHR) at the University of Hawaii at Manoa. On occasion Stole Society will also manufacture the stoles across all majors. Stole society fosters positive relationships through the proceeds from stoles that supplement events and scholarships for the FDM students and its members of the organization. The club activity is not limited only to manufacturing stoles. Stole society also aids with coordinating fundraiser events, assisting in the necessary operational functions of FDM's annual fashion show and promoting the FDM program at UHM.",
    "owner": "Cara Yoshimi",
    "ownerMail": "cara@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Student Chapter of the American Society of Landscape Architects",
    "type": "Academic/Professional",
    "description": "The purpose of SCASLA is the advancement of knowledge, education, and skill in the art and science of landscape architecture as an instrument of service in the public welfare. To this end, SCASLA promotes the profession of landscape architecture and advances the practice through advocacy, education, communication, and fellowship.",
    "owner": "Alzira Fernandes",
    "ownerMail": "alzira@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Student Nurses' Association at UH Manoa",
    "type": "Academic/Professional",
    "description": "A. To assume responsibility for contributing to nursing education in order to provide for the highest quality of health care.B. To provide programs representative of fundamental interests and concerns to nursing students.C. To aid in the development of the whole person, including his/her professional role,his/her responsibility for health care of people in all walks of life.1. SNA members will work to create a positive, professional atmosphere, which will focus on mentorship, leadership, and collaboration.2. To promote open communication and collaboration throughout the student body,faculty, and administration of the nursing program.3. To select students as representatives to participate on school committees in order to share responsibility and accountability for governance within the nursing program.4. SNA officers and class representatives will act as advocates for nursing students by effectively articulating the collective concerns of the student body through the established channels of communication at the Department of Nursing.5. To foster and develop mentoring relationships among students by assisting new students in the school orientation program and offering ongoing assistance on a formal and/or informal basis.6. To promote participation in all SNA/class activities and opportunities to develop leadership skills through various volunteer, social, educational, and fundraising activities.7. To represent the students of the Department of Nursing (DON) in the pursuit of excellence in educational training toward competent, professional care and practice.8. To facilitate student knowledge of and participation in professional nursing organizations.9. To assist in increased public understanding of the role of the student and professional nurse beyond the clinical setting.10. To seek and provide service opportunities for students that meet the health care needs and well being of community members regardless of race, ethnicity, gender, sexual orientation, socioeconomic status, age, physical abilities, political beliefs, religious beliefs, nationality, or other ideologies.",
    "owner": "Natalie Welch",
    "ownerMail": "natalie@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Students for Life at the University of Hawaii, Manoa",
    "type": "Political",
    "description": "Students for Life at University of Hawaii Manoa(SFL- UHM) was founded in November, 2022, to form a community of pro-life students on campus. Members of SFL-UHM work to protect life from conception to natural death, particularly those lives threatened by abortion, infanticide, embryonic stem cell research, and euthanasia. In furtherance of these goals, members seek to promote respect for life at UHM and on a local, state and national level, to educate people on life issues, to help those in need see that life is a promising choice and to work with others who share common goals.",
    "owner": "Caitlin Mallen",
    "ownerMail": "caitlin@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Student Veterans of America at the University of Hawai'i at Manoa (SVA)",
    "type": "Academic/Professional",
    "description": "SVA's purpose is to establish ties with the community and school while empowering veterans to pursue their education during their transition from military life to civilian life at the University of Hawai'i at Manoa.",
    "owner": "Kenneth Lopez",
    "ownerMail": "kenneth@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Students Interested in Pathology",
    "type": "Academic/Professional",
    "description": "The purpose of the organization shall be to:A. Provide a platform for medical students interested in pathology to interact with peers who share similar interests and goals.B. Provide opportunities for medical students to expand their knowledge of pathology by means of review sessions, workshops, and presentations. C. Aid medical students in their residency search and application process. D. Engage students in their first year anatomy class with histologic review of thin gross anatomy dissections and cover costs related to histologic preparations.",
    "owner": "Carley Kida",
    "ownerMail": "carley@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Supporting Women in Technology and Computing Hawaii at Manoa",
    "type": "Academic/Professional",
    "description": "To support women and minorities, promote gender and racial equality, facilitate professional, technical & personal development events, create an environment and atmosphere where women can feel safe, prevent violence against women by raising awareness of campus resources, and provide an overall sense of community.",
    "owner": "Chelsea Nguyen",
    "ownerMail": "chelsea@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Surfrider at UH Manoa",
    "type": "Sports/Leisure",
    "description": "The Surfrider Foundation is dedicated to the protection and enjoyment of the world's ocean, waves and beaches, for all people, through a powerful activist network.",
    "owner": "Ana Velasquez",
    "ownerMail": "ana@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Tau Beta Pi",
    "type": "Academic/Professional",
    "description": "Tau Beta Pi is universally recognized as the preeminent engineering honor society that students of all engineering disciplines strive to join. The purpose of this organization shall be to recognize students based on scholastic and professional excellence in engineering, develop professional skills, provide leadership, professional development training for engineering students, and to promote the collegiate study of engineering. TBP serves to promote academic, intellectual, cultural, and social understanding throughout the engineering student body, and to provide students with an astounding engineering environment.",
    "owner": "Evan Peng",
    "ownerMail": "evan@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Tea Club at the University of Hawaii at Manoa",
    "type": "Ethnic/Cultural",
    "description": "To promote peacefulness from one bowl of tea, and enjoy Japanese culture.",
    "owner": "Hung Wen",
    "ownerMail": "hung@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "TEAM RoSE",
    "type": "Academic/Professional",
    "description": "Team RoSE has the goal to create a professional and safe atmosphere for students to collaborate on an engineering project that aims to design and fabricate a rover for the University Rover Challenge.",
    "owner": "Deborah Higa",
    "ownerMail": "deborah@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "The IMUA Scholarly Society",
    "type": "Academic/Professional",
    "description": "The IMUA Scholarly Society is a knowledge-innovation and transformational-learning community open to all members of the University of Hawai'i's 'Ohana and their community partners who are willing to collaborate to cultivate the collective intelligence and wisdom crucial for leading a dignified, fulfilling, and nature-respecting life in a rapidly changing and complex world. IMUA Labs is established to foster inclusive ecosocial innovation, advance transdisciplinary knowledge production, and promote systemic literacy for the benefit of all communities that call The Hawaiian Islands their home. The organization facilitates reflexive organizational learning within regional academic ecosystems aimed at generating intellectual capacity necessary for mounting effective responses to the grand challenges of socioecological transformation, energy transition, and climate change.",
    "owner": "Victor Gregor Limon",
    "ownerMail": "victor@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "The Navigators at UH Manoa",
    "type": "Religious/Spiritual",
    "description": "1. Assisting students in making personal discoveries about the Christian faith through Bible study and open discussion. 2. Presenting the truths of the Bible in an understandable and relevant manner as they apply to life. 3. Giving opportunity for students to assume positions of leadership, helping them to grow in responsibility and character. 4. Providing an atmosphere for Christian growth and service.",
    "owner": "Adam Hu",
    "ownerMail": "adam@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "The Pre-Veterinary Club at UH Manoa",
    "type": "Academic/Professional",
    "description": "The Pre-Veterinary Club at the University of Hawaii at Manoa is committed to students who share an interest and passion for animals and veterinary medicine. The club accomplishes its mission by organizing events that emphasize education and hands-on experience. The club also participates in community service events.",
    "owner": "Dominique Wenzler-Steves",
    "ownerMail": "dominique@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Timpuyog Organization",
    "type": "Ethnic/Cultural",
    "description": "\"To serve the needs of students of the Ilokano language and literature program and others interested in the Ilokano the Ilokano language and Philippine culture. To promote the Ilokano language and Philippine culture in the community. To instill pride in our Ilokano heritage. To develop leadership skills among the students. To help students develop proficiency in Ilokano and awareness of Filipino traditions and values through meaningful language and culutral activities. To serve the community through cultural presentations. To encourage Ilokano students to speak Ilokano. To serve as role models for our Filipino youth. Our Mission and Motto: We, the students of the Timpuyog Organization, believe in establishing a spirit of pride, emphasizing the advancement of the Ilokano language and culture, and providing opportunities for the meaningful exchanges of ideas. \"Striving to preserve the Ilokano language, culture, and traditions in today's youth...the leaders of tomorrow.\"",
    "owner": "Laridel Basilio",
    "ownerMail": "laridel@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Travel Industry Management Student Association",
    "type": "Academic/Professional",
    "description": "The Travel Industry Management Student Association (TIMSA) at the University of Hawaii at Manoa (UHM) is a club designed for students of ALL majors who are passionate about the hospitality and travel industries. By creating a distinct network of peers and industry leaders, TIMSA members will be encouraged and driven to pursue their goals and become successful professionals within their careers. Not only designed for students to network, TIMSA is built upon the foundation of community and giving back. TIMSA is heavily involved in community service and fundraising with the ambition of raising awareness, building relationships, and nurturing the community as well as in the industry. Members are given the opportunity to visit various hospitality and travel enterprises, as well as meet the professionals that run them. Through site inspections and workshops, members will be able to hear and get real world experience of what it is like to work within their chosen industry.",
    "owner": "Fanglin Xu",
    "ownerMail": "fanglin@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Tropical Plant and Soil Sciences Graduate Student Organization at the University of Hawai'i at Manoa",
    "type": "Academic/Professional",
    "description": "To engender a community between TPSS students and faculty through its mission of providing educational and professional resources, opportunities,networking, and advocacy within and beyond our department.The TPSS GSO Primary Functions are:1. To provide input on policies and decisions affecting TPSS graduate students and department2. To act as an advisory body to the administration and faculty of theTPSS department3. To initiate and maintain co-curricular programs and activities that are relevant to the TPSS graduate students.",
    "owner": "Sebastian Church",
    "ownerMail": "sebastian@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "University Students of Urban and Regional Planning", 
    "type": "Student Affairs",
    "description": "The council focuses on understanding the needs of the students, discovering resources, and organizing activities and events that would help improve the student experience.",
    "owner": "Henrik Weiberg",
    "ownerMail": "henrik@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Volunteers for Intercultural and Definitive Adventures (VIDA)",
    "type": "Academic/Professional",
    "description": "VIDA is a non-profit organization that aims to provide medical, dental and veterinary care to rural and impoverished communities in countries in Central America. VIDA Hawaii is the first and only VIDA chapter in the state, and at UH Manoa. VIDA Hawaii aims to provide a service learning experience to students who have an interest in the healthcare field and/or helping communities in need.",
    "owner": "Celinndion Tauheango",
    "ownerMail": "celinndion@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Wai'anapanapa",
    "type": "Ethnic/Cultural",
    "description": "The purpose of this organization is to continue the education of the Hawaiian culture through its language, chant and dance; to teach Hawaiian family values and morals; and to assist in developing the skills of the hula and chant.",
    "owner": "Takumi Oshima",
    "ownerMail": "takumi@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Waikiki Acrobatic Troupe at UHManoa",
    "type": "Sports/Leisure",
    "description": "The Waikiki Acrobatic Troupe at UHManoa is dedicated to the learning and teaching of acrobatic skills in a friendly, safe, respectful and supportive environment.",
    "owner": "Richard Criley",
    "ownerMail": "richard@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Wellness Warriors",
    "type": "Academic/Professional",
    "description": "Our mission is to bring the health and wellness ideals of the Blue Zones Project to incorporate the Power 9 Principles into student's lives at UHM.",
    "owner": "Isabel Cleofe",
    "ownerMail": "isabel@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Whining and Dining",
    "type": "Leisure/Recreational",
    "description": "From students of different majors together, we will share meals and socialize in a relaxed, friendly atmosphere. Through the shared experience of trying new foods, members can break down barriers between majors and build relationships with students they may not have otherwise interacted with. Each meeting, the club will select a theme for the meal, and members are encouraged to bring dishes that represent their cultural background or personal tastes. The Club aims to foster a sense of community on campus and create a space where students can expand their culinary horizons and connect with others.",
    "owner": "Jenny Brown",
    "ownerMail": "jenny@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "World Can't Wait Hawai'i",
    "type": "Political",
    "description": "World Can't Wait Hawai'i exposes the crimes of the U.S. government, regardless of which political party holds power. We stand against war on the world and put humanity and the planet first. We oppose fascism and support refusefascism.org. We defend abortion rights and support riseup4abortionrights.org.",
    "owner": "Julia Tefft",
    "ownerMail": "juliat@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Young Life College",
    "type": "Religious/Spiritual",
    "description": "Young Life is a non-denominational non-profit that reaches out to students through volunteers, staff, events, camps, campus involvement and adventure. Young Life believes in meaningful mentorships that enable students to see that their lives have great worth, purpose and value. Young Life also provides a voluntary leadership training program for college students to become mentors to local middle school and high school students.",
    "owner": "Sydney Kealanahele",
    "ownerMail": "sydneyk@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    },
    {
    "name": "Young Skal",
    "type": "Academic/Professional",
    "description": "To develop friendship and common purpose between the students of the educational establishment, by participating in areas related to the tourism industry, and also in cultural, sports, travel and public relations activities. To encourage and assist in the tourism education or experience of the members by participating in activities and meeting members of Skal International Hawaii. To cooperate voluntarily in all activities and the organization set up by Skal International Hawaii. To promote training opportunities for its members and to acquire professional experience with the support of Skal International. To ensure that its members are fully aware of Skal International, locally, nationally and internationally",
    "owner": "Chassidy Sakamoto",
    "ownerMail": "chassidy@foo.com",
    "members": [],
    "image": "images/generic-club.png"
    }
  ]
}